main_type_values = ['زراعي غير عضوي', 'حيواني', 'مختلط', 'منشآت وخدمات مساندة', 'زراعي عضوي']

farm_type_values = ['زراعة بالغمر', 'جهاز ري محوري', 'بيوت محمية', 'أشجار النخيل', 'أشجار دائمة', 'مشاتل', 'الزراعة المكشوفة']

main_crops_type_values = ['أعلاف', 'تمور', 'فواكه', 'خضروات', 'ورقيات', 'قمح', 'قمح بلدي', 'شعير', 'ذرة', 'زيتون', 'بن', 'مورينقا', 'منتجات عضوية', 'شتلات أو أشجار زينة', 'لا يوجد']

irrigation_source_values = ['بئر عادي', 'بئر ارتوازي', 'بئر مشترك', 'مياه معالجة', 'شبكة ري عامة', 'صهريج ماء', 'أمطار', 'لا يوجد']

irrigation_type_values = ['ري محوري', 'ري بالغمر', 'ري بالتنقيط', 'مطرية', 'لا يوجد', 'ري مدفعي']

plantations_type_values = ['نباتات زينة', 'أشجار', 'خضروات']

protected_houses_type_values = ['بلاستيك عادي', 'بلاستيك مكيف', 'زجاج زراعة بالتربة', 'فايبر جلاس زراعة بالتربة', 'زجاج زراعة مائية', 'فايبر جلاس زراعة مائية']

region_values = ['الرياض', 'مكة المكرمة', 'المدينة المنورة', 'القصيم', 'المنطقة الشرقية', 'عسير', 'تبوك', 'حائل', 'الحدود الشمالية', 'جازان', 'نجران', 'الباحة', 'الجوف']

farming_season_values = ['صيف', 'شتاء', 'طوال العام', 'لا يوجد']

activity_status_values = ['قائم', 'متوقف حالياً', 'مهمل أو مهجور', 'لم يتم رصده']
